app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `email` = 'admin@contoh.com'
 LIMIT 1
---
    public function login()
    {
        $model = new PenggunaModel();

        // Ambil data dari form
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cari pengguna berdasarkan email
        $pengguna = $model->where('email', $email)->first();