app/Controllers/Buku.php

SELECT *
FROM `buku`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function index()
    {
        $model = new BukuModel();
        $kataKunci = $this->request->getGet('cari');
        $perHalaman = 5;

        if ($kataKunci) {
            $data = [
                'buku' => $model->cari($kataKunci)->paginate($perHalaman),
                'pager' => $model->pager,
                'kataKunci' => $kataKunci
            ];
        } else {
            $data = [
                'buku' => $model->paginate($perHalaman),
                'pager' => $model->pager,
                'kataKunci' => ''
            ];

INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`, `isbn`, `deskripsi`, `created_at`, `updated_at`) VALUES ('qwe', 'asd', 'zxc', '2134', 'aas', 'aaaa', '2026-08-13 15:02:56', '2026-08-13 15:02:56')
---
    public function simpan()
    {
        $model = new BukuModel();
        $data = $this->request->getPost();
        if ($model->save($data)) {